GuoZhiyong/RTT_GPS_STUSB/bsp/stm32f40x_car/applications/jt808.c
/*
   单包发送
 */
JT808_TX_NODEDATA * jt808_add_tx_data_single( uint8_t linkno,\
                                              JT808_MSG_TYPE type,\
                                              uint16_t id,\
                                              uint16_t len, \
                                              uint8_t *pinfo,\
                                              void ( *cb_tx_timeout )( ),\
                                              void ( *cb_tx_response )( ))
{
	uint8_t				* pdata;
	JT808_TX_NODEDATA	* pnodedata;

	pnodedata = rt_malloc( sizeof( JT808_TX_NODEDATA ) + sizeof( JT808_MSG_HEAD ) + len );
	if( pnodedata == RT_NULL )
	{
		return RT_NULL;
	}
	pnodedata->linkno	= linkno;
	pnodedata->type		= type;
	pnodedata->state	= IDLE;
	pnodedata->retry	= 0;

	if( cb_tx_timeout == RT_NULL )
	{
		pnodedata->cb_tx_timeout = jt808_tx_timeout;
	} else
	{
		pnodedata->cb_tx_timeout = cb_tx_timeout;
	}
	if( cb_tx_response == RT_NULL )
	{
		pnodedata->cb_tx_response = jt808_tx_response;
	} else
	{
		pnodedata->cb_tx_response = cb_tx_timeout;
	}
/*在此可以存储在上报*/

/*在这添加上报的记录头*/
	pnodedata->msg_len	= len + sizeof( JT808_MSG_HEAD );
	pnodedata->head_sn	= tx_seq;
	pnodedata->head_id	= id;

	pdata		= pnodedata->tag_data;
	*pdata++	= id >> 8;
	*pdata++	= id & 0xff;
	*pdata++	= len >> 8;
	*pdata++	= len & 0xff;
	memcpy( pdata, mobile, 6 );
	pdata		+= 6;
	*pdata++	= tx_seq >> 8;
	*pdata++	= tx_seq & 0xff;
	memcpy( pdata, pinfo, len );    /*填充用户数据*/
	msglist_append( list_jt808_tx, pnodedata );

	tx_seq++;
	return pnodedata;               /*返回发送包序号*/
}

/*在这里可以修改很多参数*/

/*增加一个发送节点*/
JT808_TX_NODEDATA * node_begin( uint16_t user_data_len )
{
	JT808_TX_NODEDATA	*pnodedata;
	uint8_t				*pdata;
	pnodedata = (JT808_TX_NODEDATA*)rt_malloc( sizeof( JT808_TX_NODEDATA ) + sizeof( JT808_MSG_HEAD ) + user_data_len );
	if( pnodedata == RT_NULL )
	{
		return RT_NULL;
	}
	/*拷贝终端号码*/
	pdata = pnodedata->tag_data;
	memcpy( pdata + 4, mobile, 6 );
	return pnodedata;
}

/*设置重传次数*/
void node_retry( JT808_TX_NODEDATA *pnodedata, uint32_t max_retry )
{
	pnodedata->max_retry = max_retry;
}

/*设置超时*/
void node_timeout( JT808_TX_NODEDATA *pnodedata, uint32_t timeout )
{
	pnodedata->timeout = timeout;
}

/*设置消息头 id*/
void node_head_id( JT808_TX_NODEDATA *pnodedata, uint16_t id )
{
	uint8_t *pdata = pnodedata->tag_data;
	pnodedata->head_id	= id;
	*pdata				= id >> 8;
	*( pdata + 1 )		= id & 0xff;
}

/*设置消息头 attr*/
void node_head_attr( JT808_TX_NODEDATA *pnodedata, uint16_t attr )
{
	uint8_t *pdata = pnodedata->tag_data;
	*( pdata + 2 )	= attr >> 8;
	*( pdata + 3 )	= attr & 0xff;
}

/*设置消息头 id attr*/
void node_head_id_attr( JT808_TX_NODEDATA *pnodedata, uint16_t id, uint16_t attr )
{
	uint8_t *pdata = pnodedata->tag_data;
	*pdata			= id >> 8;
	*( pdata + 1 )	= id & 0xff;
	*( pdata + 2 )	= attr >> 8;
	*( pdata + 3 )	= attr & 0xff;
}

/*设置发送的数据长度*/
void node_tx_len( JT808_TX_NODEDATA *pnodedata, uint16_t len )
{
	pnodedata->msg_len = len;
}

/*添加消息体*/
void node_body( JT808_TX_NODEDATA *pnodedata, uint8_t *pinfo, uint16_t len )
{
	uint8_t *pdata = pnodedata->tag_data;
	memcpy( pdata + 12, pinfo, len );
}

/*添加到发送列表中*/
JT808_TX_NODEDATA * node_end( JT808_TX_NODEDATA *pnodedata, uint16_t txseq )
{
	uint8_t *pdata = pnodedata->tag_data;

	pnodedata->head_sn	= txseq;
	*( pdata + 10 )		= txseq >> 8;
	*( pdata + 11 )		= txseq & 0xff;
	msglist_append( list_jt808_tx, pnodedata );
}

/*
   终端通用应答
 */
static rt_err_t jt808_tx_0x0001( uint8_t linkno, uint16_t seq, uint16_t id, uint8_t res )
{
	uint8_t				* pdata;
	JT808_TX_NODEDATA	* pnodedata;
	uint8_t				buf [256];
	uint8_t				* p;
	uint16_t			len;

	pnodedata = rt_malloc( sizeof( JT808_TX_NODEDATA ) );
	if( pnodedata == NULL )
	{
		return -RT_ERROR;
	}
	pnodedata->type				= TERMINAL_ACK;
	pnodedata->state			= IDLE;
	pnodedata->retry			= 0;
	pnodedata->cb_tx_timeout	= jt808_tx_timeout;
	pnodedata->cb_tx_response	= jt808_tx_response;

	pdata = rt_malloc( 5 + 12 );
	if( pdata == NULL )
	{
		rt_free( pnodedata );
		return -RT_ERROR;
	}

//	jt808_add_msg_head(pdata,0x0001,0x0005);
	p		= pdata + 12;
	*p++	= ( seq >> 8 );
	*p++	= ( seq & 0xff );
	*p++	= ( id >> 8 );
	*p++	= ( id & 0xff );
	*p		= res;

	pnodedata->msg_len = len;
	msglist_append( list_jt808_tx, pnodedata );
	tx_seq++;
}

/*
   平台通用应答,收到信息，停止发送
 */
static int handle_rx_0x8001( uint8_t linkno, uint8_t *pmsg )
{
	MsgListNode			* iter;
	JT808_TX_NODEDATA	* iterdata;

	uint16_t			id;
	uint16_t			seq;
	uint8_t				res;
/*跳过消息头12byte*/
	seq = ( *( pmsg + 12 ) << 8 ) | *( pmsg + 13 );
	id	= ( *( pmsg + 14 ) << 8 ) | *( pmsg + 15 );
	res = *( pmsg + 16 );

	/*单条处理*/
	iter		= list_jt808_tx->first;
	iterdata	= (JT808_TX_NODEDATA*)iter->data;
	if( ( iterdata->head_id == id ) && ( iterdata->head_sn == seq ) )
	{
		iterdata->cb_tx_response( iterdata, pmsg ); /*应答处理函数*/
		iterdata->state = ACK_OK;
	}
}

/*补传分包请求*/
static int handle_rx_0x8003( uint8_t linkno, uint8_t *pmsg )
{
}

/* 监控中心对终端注册消息的应答*/
static int handle_rx_0x8100( uint8_t linkno, uint8_t *pmsg )
{
	MsgListNode			* iter;
	JT808_TX_NODEDATA	* iterdata;

	uint16_t			body_len; /*消息体长度*/
	uint16_t			ack_seq;
	uint8_t				res;
	uint8_t				* msg;

	body_len	= ( ( *( pmsg + 2 ) << 8 ) | ( *( pmsg + 3 ) ) ) & 0x3FF;
	msg			= pmsg + 12;

	ack_seq = ( *msg << 8 ) | *( msg + 1 );
	res		= *( msg + 2 );

	iter		= list_jt808_tx->first;
	iterdata	= iter->data;
	if( ( iterdata->head_id == 0x0100 ) && ( iterdata->head_sn == ack_seq ) )
	{
		if( res == 0 )
		{
			strncpy( term_param.register_code, msg + 3, body_len - 3 );
			iterdata->state = ACK_OK;
		}
	}
	return 1;
}

/*设置终端参数*/
static int handle_rx_0x8103( uint8_t linkno, uint8_t *pmsg )
{
	uint8_t		* p;
	uint8_t		res = 0;

	uint16_t	msg_len, count = 0;
	uint32_t	param_id;
	uint8_t		param_len;

	uint16_t	seq, id;

	if( *( pmsg + 2 ) >= 0x20 ) /*如果是多包的设置参数*/
	{
		rt_kprintf( "\r\n>%s multi packet no support!", __func__ );
		return 1;
	}

	id	= ( pmsg[0] << 8 ) | pmsg[1];
	seq = ( pmsg[10] << 8 ) | pmsg[11];

	msg_len = ( ( pmsg[2] << 8 ) | pmsg[3] ) & 0x3FF - 1;
	p		= pmsg + 13;

	/*使用数据长度,判断数据是否结束，没有使用参数总数*/
	while( count < msg_len )
	{
		param_id	= ( ( *p++ ) << 24 ) | ( ( *p++ ) << 16 ) | ( ( *p++ ) << 8 ) | ( *p++ );
		param_len	= *p++;
		count		+= ( 5 + param_len );
		res			|= param_put( param_id, param_len, p );
		if( res )
		{
			rt_kprintf( "\r\n%s>res=%d\r\n", __func__, __LINE__ );
			break;
		}
	}
	/*返回通用应答*/
	jt808_tx_0x0001( linkno, seq, id, res );
	return 1;
}

/*查询全部终端参数，有可能会超出单包最大字节*/
static int handle_rx_0x8104( uint8_t linkno, uint8_t *pmsg )
{
	return 1;
}

